tap "romkatv/powerlevel10k"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "fzf-tab"
brew "git"
brew "jq"
brew "neofetch"
brew "neovim"
brew "onefetch"
brew "ripgrep"
brew "powerlevel10k"
brew "tldr"
brew "vivid"
brew "wget"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "font-jetbrains-mono-nerd-font"
cask "kitty"
cask "visual-studio-code"
vscode "coderabbit.coderabbit-vscode"
vscode "github.copilot-chat"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-typescript-next"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
